skybadger/ESP8266_AscomDome/ASCOM_DomeHandler.h
/*
File to be included into relevant device REST setup 
*/
//Assumes Use of ARDUINO ESP8266WebServer for entry handlers
#if !defined _ESP8266_DomeHandler_h_ 
#define _ESP8266_DomeHandler_h_
#include "AlpacaErrorConsts.h"
#include "ESP8266_AscomDome.h"
#include "ASCOMAPIDOME_rest.h"     //Definitions for functions
#include "JSONHelperFunctions.h"

#include <LinkedList.h>

/* 
extern int azimuth;
extern int altitude;
extern int parkPosition;
extern int homePosition;
extern bool canSyncAzimuth; 
extern bool canSetAltitude, canSetAzimuth;
extern bool atHome, atPark, canFindHome, canPark, canSetPark;
extern bool canSetShutter;
extern bool canSlave;
extern LinkedList <cmdItem_t*> domeCmdList;
extern LinkedList <cmdItem_t*> shutterCmdList;

extern cmdItem_t* addDomeCmd( int, int, enum domeCmd, int ); 
extern cmdItem_t* addShutterCmd( int, int, enum shutterCmd, int ); 
*/
bool hasArgIC( String& check, ESP8266WebServer& ref, bool caseSensitive );

void handleAltitudeGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "AltitudeGet", Success, "" );    


    /*Check there is no pending altitude cmd that this needs to wait for. 
    cmdItemPtr *pCmd;
    for( int i=0; i< domeCmdList.size(); pCmd = domeCmdList[0] )
     if (pCmd->cmd == CMD_DOMEVAR_SET && pCmd->value != -1 && !pCmd->cmdName.equalsIgnoreCase( "Altitude")")
     {
          root["Value"] = altitude;
     }
    else
    {
      
    }
    This is the sort of way we would like to behave
    */
    
    root["Value"] = altitude;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    debugI( "AltitudeGet: %s", message.c_str() );    
    server.send(200, F("application/json"), message);
    return ;
}

void handleAtHomeGet( void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "AtHome", 0, "" );    
    root["Value"] = ( abs( currentAzimuth - homePosition ) <= acceptableAzimuthError )? atHome = true : atHome = false;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    debugI( "AtHomeGet : %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;
}

void handleAtParkGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID,"AtPark", 0, "" );    
    root["Value"] = ( abs( currentAzimuth - parkPosition) <= acceptableAzimuthError ) ? atPark = true : atPark = false;
    root.printTo(message);
    debugI("AtParkGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;
}

void handleAzimuthGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "Azimuth", 0, "" );    
    root["Value"] = currentAzimuth;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    debugI("AzimuthGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;
}

void handleCanFindHomeGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CanFindHome", 0, "" );    
    root["Value"] = canFindHome;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    debugI("CanFindHomeGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;
}

void handleCanParkGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();

    DynamicJsonBuffer jsonBuff(256);
    JsonObject& root = jsonBuff.createObject();

    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CanPark", 0, "" );    
    root["Value"] = canPark;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    debugI("CanParkGet: %s", message.c_str() );    
    server.send(200, F("application/json"), message);
    return ;
}

void handleCanSetAltitudeGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CanSetAltitude", 0, "" );    
    root["Value"] = canSetAltitude;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    debugI("CanSetAltitudeGet: %s", message.c_str() );    
    server.send(200, F("application/json"), message);
    return ;  
}

void handleCanSetAzimuthGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "CanSetAzimuth", Success, "" );    
    root["Value"] = canSetAzimuth;
    root.printTo(message);
    debugI( "CanSetAzimuthGet: %s", message.c_str() );
    server.send(200, F("application/json"), message);
    return ;  
}

