skybadger/ESP8266_AscomDome/ASCOM_DomeHandler.h
   //in this driver model, each device has a separate ip address ,so can only be one device. Hence ignore device-number
   addDomeCmd( clientID, transID, "", CMD_DOME_SLEW, parkPosition );      
   jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("Park"), Success, "" );    
   root.printTo(message);
   debugI( "ParkPut: %s", message.c_str() );
   server.send(200, "text/json", message);
   return ;      
}

void handleSlewToAltitudePut(void)
{
   String message;
   float location = 0.0F;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();

   String argsToSearchFor[] = {"clientID","clientTransactionID","altitude"};
   uint32_t clientID = 0;
   uint32_t transID = 0;
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
     clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();
  
  if( hasArgIC( argsToSearchFor[2], server, false ) )
     location = (boolean) server.arg( argsToSearchFor[2]).toFloat();
   
  //Removed test for DOME_IDLE since we handle this asynchronously
  if( connected != clientID ) 
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SlewToAltitude"), notConnected, "Client not connected" );    
  else if ( server.hasArg( argsToSearchFor[2] ) )
  {
    //Set new shutter altitude.
    normaliseFloat( location, SHUTTER_MAX_ALTITUDE );
    addShutterCmd( clientId, transID, "", CMD_SHUTTER_OPEN, location );
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SlewToAltitude"), Success, "" );    
  }
  else
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SlewToAltitude"), valueNotSet, F("Altitude not provided") );       
  root.printTo(message);
  debugI( "SlewToAltitudePut: %s", message.c_str() );    
  server.send(200, F("application/json"), message);
  return ;      
}

/*
 * The handler receives target Azimuth in integer degrees
 */
void handleSlewToAzimuthPut(void)
{
   String message;
   
   String argsToSearchFor[] = {"clientID","clientTransactionID","Azimuth"};
   uint32_t clientID = 0;
   uint32_t transID = 0;
   
   float location = 0.0F;
   
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();
   
  if( hasArgIC( argsToSearchFor[0], server, false ) )
    clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();
  
  if( hasArgIC( argsToSearchFor[2], server, false ) )
    location = server.arg( argsToSearchFor[2]).toFloat();
     
  //debugD( "SlewToAzimuthPut: %i", location );
 
  //Removed DOME_IDLE dependency - we don't care since this will be an async call...
  if( connected != clientID ) 
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SlewToAzimuth"), notConnected, "Not connected" ); 
  if( server.hasArg( argsToSearchFor[2] ) )
  {
    //Set new slew location.
    normaliseFloat( location, 360.0F );
    debugD( "SlewToAzimuthPut: %f", location );
    addDomeCmd( clientID, transID, "", CMD_DOME_SLEW, location );
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SlewToAzimuth"), Success, "" ); 
  }
  else 
  {
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "SlewToAzimuth", valueNotSet, "Azimuth argument not found" );
  }

  root.printTo(message);
  debugI( "SlewToAzimuthPut: %s", message.c_str() );    
  server.send(200, F("application/json"), message);
  return ;
}

/*
 * The handler receives target Azimuth in decimal degrees. 
 */
void handleSyncToAzimuthPut(void)
{
   String message;
   float location=0;
   int iTargetAzimuth = 0;

   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();

   String argsToSearchFor[] = {"clientID","clientTransactionID","Azimuth"};
   uint32_t clientID = 0;
   uint32_t transID = 0;
    
  if( hasArgIC( argsToSearchFor[0], server, false ) )
    clientID = (uint32_t)server.arg( argsToSearchFor[0] ).toInt();
  
  if( hasArgIC( argsToSearchFor[1], server, false ) )
     transID = (uint32_t)server.arg( argsToSearchFor[1] ).toInt();
  
  if( hasArgIC( argsToSearchFor[2], server, false ) )
     location = server.arg( argsToSearchFor[2]).toFloat();

  if( connected != clientID ) 
      jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SyncToAzimuth"), notConnected, "Not connected" );    
  if( server.hasArg( argsToSearchFor[2] ) )
  {
    //Set new (actual) azimuth location.
    normaliseFloat( location, 360.0F );
    
    //The offset is the difference between where the dome is currently pointing and where we are told it is pointing.
    azimuthSyncOffset = (float) ( location - currentAzimuth );
    
    //Because we can go out of range we do this again
    normaliseFloat( azimuthSyncOffset, 360.0F );
    
    addDomeCmd( clientID, transID, "azimuthSyncOffset", CMD_DOMEVAR_SET, azimuthSyncOffset );
    //Tell the dome to move to the target azimuth using the updated correction
    addDomeCmd( clientID, transID, "", CMD_DOME_SLEW, iTargetAzimuth );
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, F("SyncToAzimuth"), Success, "" );    
  }
  else
    jsonResponseBuilder( root, clientID, transID, ++serverTransID, "SyncToAzimuth", valueNotSet, "Argument not found" );       

  root.printTo(message);
  debugI( "SyncToAzimuthPut: %s", message.c_str() );    
  server.send(200, F("application/json"), message);
  return ;
}

#endif
